--- src/app_shell.rs
+++ replace permission_reauthorization_requested -> bool with false
@@ -7,18 +7,17 @@
 
 pub const REAUTHORIZE_PERMISSIONS_ARGUMENT: &str = "--reauthorize-permissions";
 
 pub fn permission_reauthorization_requested<I, S>(args: I) -> bool
 where
     I: IntoIterator<Item = S>,
     S: AsRef<str>,
 {
-    args.into_iter()
-        .any(|arg| arg.as_ref() == REAUTHORIZE_PERMISSIONS_ARGUMENT)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn build_tray_menu_items() -> Vec<(&'static str, &'static str)> {
     vec![("settings", "Settings\u{2026}"), ("quit", "Quit Slugtale")]
 }
 
 /// Whether a window should hide (stay alive) on a close request rather than be
 /// destroyed. Slugtale is a tray resident app (ADR-0008): the settings window is
