--- src/main.rs
+++ replace set_launch_at_login_state -> Result<(), String> with Ok(())
@@ -1088,22 +1088,17 @@
         position_dictation_bar(&window, appearance.position, &bar_display);
     });
 }
 
 /// Register or unregister the app as an OS login item to match the desired state.
 /// Backed by tauri-plugin-autostart (a macOS LaunchAgent), which keeps this off the
 /// dictation hot path and gives the Windows port the same abstraction for free.
 fn set_launch_at_login_state(app: &tauri::AppHandle, enabled: bool) -> Result<(), String> {
-    let autolaunch = app.autolaunch();
-    if enabled {
-        autolaunch.enable().map_err(|error| error.to_string())
-    } else {
-        autolaunch.disable().map_err(|error| error.to_string())
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[tauri::command]
 fn save_launch_at_login(
     app: tauri::AppHandle,
     enabled: bool,
 ) -> Result<slugtale_lib::Settings, String> {
     let previous = load_current_settings(&app);
