--- src/app_files.rs
+++ replace AppFiles::settings -> Settings with Default::default()
@@ -64,19 +64,17 @@
         self.data_dir
             .as_ref()
             .map(|dir| dir.join(MODELS_DIR))
             .ok_or_else(|| "could not resolve model directory".to_string())
     }
 
     /// Current Settings, or defaults when no file exists yet.
     pub fn settings(&self) -> Settings {
-        self.settings_path()
-            .map(|path| load_settings(&path))
-            .unwrap_or_default()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn save_settings(&self, settings: &Settings) -> Result<(), String> {
         let path = self
             .settings_path()
             .ok_or_else(|| "could not resolve settings path".to_string())?;
         if let Some(parent) = path.parent() {
             std::fs::create_dir_all(parent).map_err(|error| error.to_string())?;
