--- src/app_shell.rs
+++ replace dictation_bar_should_take_focus -> bool with true
@@ -24,17 +24,17 @@
 /// destroyed. Slugtale is a tray resident app (ADR-0008): the settings window is
 /// reopened from the tray, so closing it must hide it — destroying it both kills
 /// the only reopen path and, as the last window, would quit the whole app.
 pub fn hides_on_close(window_label: &str) -> bool {
     window_label == "settings"
 }
 
 pub fn dictation_bar_should_take_focus() -> bool {
-    false
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn show_settings(app: tauri::AppHandle) {
     if let Some(window) = app.get_webview_window("settings") {
         let _ = window.show();
         let _ = window.set_focus();
     }
 }
