--- src/app_shell.rs
+++ replace show_settings with ()
@@ -28,20 +28,17 @@
     window_label == "settings"
 }
 
 pub fn dictation_bar_should_take_focus() -> bool {
     false
 }
 
 pub fn show_settings(app: tauri::AppHandle) {
-    if let Some(window) = app.get_webview_window("settings") {
-        let _ = window.show();
-        let _ = window.set_focus();
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn setup_tray(app: &mut App) -> Result<(), Box<dyn std::error::Error>> {
     let items = build_tray_menu_items();
 
     let mut menu_items: Vec<Box<dyn tauri::menu::IsMenuItem<tauri::Wry>>> = Vec::new();
     for (id, label) in &items {
         let item = MenuItem::with_id(app, *id, *label, true, None::<&str>)?;
