--- src/app_shell.rs
+++ replace setup_tray -> Result<(), Box<dyn std::error::Error>> with Ok(())
@@ -35,47 +35,17 @@
 pub fn show_settings(app: tauri::AppHandle) {
     if let Some(window) = app.get_webview_window("settings") {
         let _ = window.show();
         let _ = window.set_focus();
     }
 }
 
 pub fn setup_tray(app: &mut App) -> Result<(), Box<dyn std::error::Error>> {
-    let items = build_tray_menu_items();
-
-    let mut menu_items: Vec<Box<dyn tauri::menu::IsMenuItem<tauri::Wry>>> = Vec::new();
-    for (id, label) in &items {
-        let item = MenuItem::with_id(app, *id, *label, true, None::<&str>)?;
-        menu_items.push(Box::new(item));
-    }
-
-    let menu_refs: Vec<&dyn tauri::menu::IsMenuItem<tauri::Wry>> =
-        menu_items.iter().map(|i| i.as_ref()).collect();
-    let menu = Menu::with_items(app, &menu_refs)?;
-
-    let icon = Image::from_bytes(include_bytes!("../icons/icon.png"))?;
-
-    TrayIconBuilder::new()
-        .icon(icon)
-        .icon_as_template(true)
-        .tooltip("Slugtale")
-        .menu(&menu)
-        .on_menu_event(|app, event| match event.id.as_ref() {
-            "settings" => {
-                show_settings(app.clone());
-            }
-            "quit" => {
-                app.exit(0);
-            }
-            _ => {}
-        })
-        .build(app)?;
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn installed_app_reauthorization_mode_is_selected_by_its_launch_argument() {
