--- src/app_shell.rs
+++ delete match arm "settings" in setup_tray
@@ -55,19 +55,17 @@
     let icon = Image::from_bytes(include_bytes!("../icons/icon.png"))?;
 
     TrayIconBuilder::new()
         .icon(icon)
         .icon_as_template(true)
         .tooltip("Slugtale")
         .menu(&menu)
         .on_menu_event(|app, event| match event.id.as_ref() {
-            "settings" => {
-                show_settings(app.clone());
-            }
+             /* ~ changed by cargo-mutants ~ */
             "quit" => {
                 app.exit(0);
             }
             _ => {}
         })
         .build(app)?;
 
     Ok(())
