--- src/audio_capture.rs
+++ replace / with * in window_average
@@ -96,17 +96,17 @@
         let overlap = cell_end.min(end) - cell_start.max(start);
         if overlap > 0.0 {
             weighted += value as f64 * overlap;
             total += overlap;
         }
     }
 
     if total > 0.0 {
-        (weighted / total) as f32
+        (weighted * /* ~ changed by cargo-mutants ~ */ total) as f32
     } else {
         mono[first.min(len - 1)]
     }
 }
 
 pub fn audio_level_from_samples(samples: &[f32]) -> f32 {
     if samples.is_empty() {
         return 0.0;
