--- src/audio_capture.rs
+++ replace - with + in window_average
@@ -98,17 +98,17 @@
             weighted += value as f64 * overlap;
             total += overlap;
         }
     }
 
     if total > 0.0 {
         (weighted / total) as f32
     } else {
-        mono[first.min(len - 1)]
+        mono[first.min(len + /* ~ changed by cargo-mutants ~ */ 1)]
     }
 }
 
 pub fn audio_level_from_samples(samples: &[f32]) -> f32 {
     if samples.is_empty() {
         return 0.0;
     }
 
