--- src/audio_capture.rs
+++ replace audio_level_from_samples -> f32 with -1.0
@@ -103,26 +103,17 @@
     if total > 0.0 {
         (weighted / total) as f32
     } else {
         mono[first.min(len - 1)]
     }
 }
 
 pub fn audio_level_from_samples(samples: &[f32]) -> f32 {
-    if samples.is_empty() {
-        return 0.0;
-    }
-
-    let mean_square = samples
-        .iter()
-        .map(|sample| sample.clamp(-1.0, 1.0).powi(2))
-        .sum::<f32>()
-        / samples.len() as f32;
-    mean_square.sqrt().clamp(0.0, 1.0)
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 pub const DIGITAL_SILENCE_EPSILON: f32 = 0.000_01;
 
 fn require_captured_microphone_signal(audio: &CapturedAudio) -> Result<(), AudioCaptureError> {
     // A denied macOS microphone does not fail the CoreAudio stream. It supplies
     // a correctly timed buffer of digital silence instead, which Whisper
     // canonically transcribes as "You" (slugtale-d3k). Real microphones have a
