--- src/audio_capture.rs
+++ delete - in audio_level_from_samples
@@ -109,17 +109,17 @@
 
 pub fn audio_level_from_samples(samples: &[f32]) -> f32 {
     if samples.is_empty() {
         return 0.0;
     }
 
     let mean_square = samples
         .iter()
-        .map(|sample| sample.clamp(-1.0, 1.0).powi(2))
+        .map(|sample| sample.clamp( /* ~ changed by cargo-mutants ~ */1.0, 1.0).powi(2))
         .sum::<f32>()
         / samples.len() as f32;
     mean_square.sqrt().clamp(0.0, 1.0)
 }
 
 pub const DIGITAL_SILENCE_EPSILON: f32 = 0.000_01;
 
 fn require_captured_microphone_signal(audio: &CapturedAudio) -> Result<(), AudioCaptureError> {
