--- src/audio_capture.rs
+++ replace CapturedAudio::mono_16khz -> Self with Default::default()
@@ -4,20 +4,17 @@
 #[derive(Debug, Clone, PartialEq, Serialize, Deserialize)]
 pub struct CapturedAudio {
     pub sample_rate_hz: u32,
     pub samples: Vec<f32>,
 }
 
 impl CapturedAudio {
     pub fn mono_16khz(samples: Vec<f32>) -> Self {
-        Self {
-            sample_rate_hz: 16_000,
-            samples,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub fn captured_audio_from_interleaved_input(
     sample_rate_hz: u32,
     channels: u16,
     samples: &[f32],
 ) -> Result<CapturedAudio, AudioCaptureError> {
