--- src/audio_capture.rs
+++ replace require_captured_microphone_signal -> Result<(), AudioCaptureError> with Ok(())
@@ -122,28 +122,17 @@
 
 pub const DIGITAL_SILENCE_EPSILON: f32 = 0.000_01;
 
 fn require_captured_microphone_signal(audio: &CapturedAudio) -> Result<(), AudioCaptureError> {
     // A denied macOS microphone does not fail the CoreAudio stream. It supplies
     // a correctly timed buffer of digital silence instead, which Whisper
     // canonically transcribes as "You" (slugtale-d3k). Real microphones have a
     // noise floor above this -100 dBFS threshold even in a quiet room.
-    let rms = audio_level_from_samples(&audio.samples);
-    let peak = audio
-        .samples
-        .iter()
-        .fold(0.0f32, |highest, sample| highest.max(sample.abs()));
-    if rms <= DIGITAL_SILENCE_EPSILON && peak <= DIGITAL_SILENCE_EPSILON {
-        return Err(AudioCaptureError::new(
-            "no microphone signal was captured; check Slugtale under System Settings > Privacy & Security > Microphone",
-        ));
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Map a raw microphone RMS level into the 0..1 range the dictation waveform
 /// renders. Raw speech RMS is tiny (~0.06) and barely moves the bars, so the
 /// waveform looked like it drifted on its own rather than reacting to the voice
 /// (slugtale-hla). A noise floor keeps quiet rooms in the idle state, a ceiling
 /// saturates loud speech, and a square-root curve lifts ordinary speech into a
 /// clearly active, bouncing range.
