--- src/audio_capture.rs
+++ replace voice_level_from_rms -> f32 with 0.0
@@ -143,21 +143,17 @@
 
 /// Map a raw microphone RMS level into the 0..1 range the dictation waveform
 /// renders. Raw speech RMS is tiny (~0.06) and barely moves the bars, so the
 /// waveform looked like it drifted on its own rather than reacting to the voice
 /// (slugtale-hla). A noise floor keeps quiet rooms in the idle state, a ceiling
 /// saturates loud speech, and a square-root curve lifts ordinary speech into a
 /// clearly active, bouncing range.
 pub fn voice_level_from_rms(rms: f32) -> f32 {
-    const NOISE_FLOOR: f32 = 0.012;
-    const SPEECH_CEILING: f32 = 0.18;
-
-    let normalized = ((rms - NOISE_FLOOR) / (SPEECH_CEILING - NOISE_FLOOR)).clamp(0.0, 1.0);
-    normalized.sqrt()
+    0.0 /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct AudioCaptureError {
     message: String,
 }
 
 impl AudioCaptureError {
