--- src/audio_capture.rs
+++ replace % with / in RealtimeCaptureBuffer::read_range
@@ -415,17 +415,17 @@
     /// [`Self::drain`] and [`Self::drain_through`]; both callers have already
     /// clamped their range.
     fn read_range(&self, from: usize, to: usize) -> Result<Vec<f32>, AudioCaptureError> {
         use std::sync::atomic::Ordering;
 
         let available = to.wrapping_sub(from).min(self.slots.len());
         let mut samples = Vec::with_capacity(available);
         for offset in 0..available {
-            let slot = from.wrapping_add(offset) % self.slots.len();
+            let slot = from.wrapping_add(offset) / /* ~ changed by cargo-mutants ~ */ self.slots.len();
             samples.push(f32::from_bits(self.slots[slot].load(Ordering::Relaxed)));
         }
         self.read_position.store(to, Ordering::Release);
 
         if self.overflowed.swap(false, Ordering::Relaxed) {
             return Err(AudioCaptureError::new(RECORDING_LIMIT_ERROR));
         }
         Ok(samples)
