--- src/audio_capture.rs
+++ delete ! in CpalAudioRecorder::build_stream
@@ -527,17 +527,17 @@
                         let mut mono_sum = 0.0f32;
                         for value in frame.iter().copied() {
                             let sample = f32::from_sample(value);
                             sum_of_squares += sample.clamp(-1.0, 1.0).powi(2);
                             mono_sum += sample;
                         }
                         callback_buffer.push_sample(mono_sum / channels as f32);
                     }
-                    if !data.is_empty() {
+                    if  /* ~ changed by cargo-mutants ~ */data.is_empty() {
                         let rms = (sum_of_squares / data.len() as f32).sqrt().clamp(0.0, 1.0);
                         let level = voice_level_from_rms(rms);
                         // Pair the perceptual level with the ring position it
                         // belongs to: the watermark a Pause Flush cuts at.
                         // One extra atomic store on voiced buffers only — the
                         // callback stays lock-free and allocation-free.
                         if level > crate::SEGMENT_VOICE_LEVEL {
                             callback_buffer.mark_voice();
