--- src/audio_capture.rs
+++ delete ! in CpalAudioRecorder::pause_active_stream
@@ -574,17 +574,17 @@
                 "unsupported input sample format: {other}"
             ))),
         }
     }
 
     fn pause_active_stream(&mut self) {
         use cpal::traits::StreamTrait;
 
-        if !self.stream_active {
+        if  /* ~ changed by cargo-mutants ~ */self.stream_active {
             return;
         }
 
         if let Some(stream) = self.stream.as_ref() {
             if let Err(error) = stream.pause() {
                 // Dropping the stream still stops capture. Forget its identity so
                 // the next start builds fresh rather than reusing the failed one.
                 eprintln!("could not pause audio input stream; rebuilding next time: {error}");
