--- src/audio_capture.rs
+++ replace <impl AudioRecorder for CpalAudioRecorder>::stop -> Result<CapturedAudio, AudioCaptureError> with Ok(Default::default())
@@ -758,25 +758,17 @@
                 // The waveform is cosmetic; capture must not fail without it.
                 Err(error) => eprintln!("could not start audio level emitter: {error}"),
             }
         }
         Ok(())
     }
 
     fn stop(&mut self) -> Result<CapturedAudio, AudioCaptureError> {
-        self.pause_active_stream();
-        self.stop_level_emitter();
-        let samples = self
-            .buffer
-            .as_ref()
-            .ok_or_else(|| AudioCaptureError::new("audio capture buffer is unavailable"))?
-            .drain()?;
-
-        captured_audio_from_interleaved_input(self.sample_rate_hz, self.channels, &samples)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn cancel(&mut self) -> Result<(), AudioCaptureError> {
         self.pause_active_stream();
         self.stop_level_emitter();
         if let Some(buffer) = self.buffer.as_ref() {
             buffer.clear();
         }
