--- src/audio_capture.rs
+++ replace window_average -> f32 with 1.0
@@ -71,45 +71,17 @@
     Ok(CapturedAudio::mono_16khz(resampled))
 }
 
 /// Average the mono signal over the source-sample window `[start, end)`,
 /// treating each input sample as covering a unit-width cell. This box filter
 /// band-limits the signal ahead of decimation so downsampling to 16 kHz does not
 /// alias high-frequency microphone content into the speech band.
 fn window_average(mono: &[f32], start: f64, end: f64) -> f32 {
-    let len = mono.len();
-    if len == 0 {
-        return 0.0;
-    }
-    let start = start.max(0.0);
-    let end = end.min(len as f64);
-    if end <= start {
-        return mono[(start as usize).min(len - 1)];
-    }
-
-    let first = start.floor() as usize;
-    let last = (end.ceil() as usize).min(len);
-    let mut weighted = 0.0f64;
-    let mut total = 0.0f64;
-    for (offset, &value) in mono[first..last].iter().enumerate() {
-        let cell_start = (first + offset) as f64;
-        let cell_end = cell_start + 1.0;
-        let overlap = cell_end.min(end) - cell_start.max(start);
-        if overlap > 0.0 {
-            weighted += value as f64 * overlap;
-            total += overlap;
-        }
-    }
-
-    if total > 0.0 {
-        (weighted / total) as f32
-    } else {
-        mono[first.min(len - 1)]
-    }
+    1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn audio_level_from_samples(samples: &[f32]) -> f32 {
     if samples.is_empty() {
         return 0.0;
     }
 
     let mean_square = samples
