--- src/audio_capture.rs
+++ replace <= with > in window_average
@@ -77,17 +77,17 @@
 /// alias high-frequency microphone content into the speech band.
 fn window_average(mono: &[f32], start: f64, end: f64) -> f32 {
     let len = mono.len();
     if len == 0 {
         return 0.0;
     }
     let start = start.max(0.0);
     let end = end.min(len as f64);
-    if end <= start {
+    if end > /* ~ changed by cargo-mutants ~ */ start {
         return mono[(start as usize).min(len - 1)];
     }
 
     let first = start.floor() as usize;
     let last = (end.ceil() as usize).min(len);
     let mut weighted = 0.0f64;
     let mut total = 0.0f64;
     for (offset, &value) in mono[first..last].iter().enumerate() {
