--- src/audio_capture.rs
+++ delete ! in AudioCaptureSession<R>::flush_segment_through
@@ -870,17 +870,17 @@
 
     /// Like [`Self::flush_segment`], but cut at a stable sample watermark: only
     /// audio through `cut` plus the quiet-tail guard joins this segment, so a
     /// slow worker queue cannot append later speech to it (slugtale-g1o.4).
     pub fn flush_segment_through(
         &mut self,
         cut: u64,
     ) -> Result<Option<CapturedAudio>, AudioCaptureError> {
-        if !self.active {
+        if  /* ~ changed by cargo-mutants ~ */self.active {
             return Ok(None);
         }
 
         let audio = self.recorder.take_segment_through(cut)?;
         if audio.samples.is_empty() {
             return Ok(None);
         }
 
