--- src/audio_capture.rs
+++ replace VoiceActivationCapture<R>::start -> Result<(), AudioCaptureError> with Ok(())
@@ -952,22 +952,17 @@
         }
     }
 
     pub fn is_open(&self) -> bool {
         self.open
     }
 
     pub fn start(&mut self) -> Result<(), AudioCaptureError> {
-        if self.open {
-            return Ok(());
-        }
-        self.recorder.start()?;
-        self.open = true;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn take_segment(&mut self) -> Result<CapturedAudio, AudioCaptureError> {
         self.recorder.take_segment()
     }
 
     /// Stop capture if it is running, then replace the recorder so the next
     /// start cannot resume a paused stream.
