--- src/audio_capture.rs
+++ replace += with -= in window_average
@@ -90,17 +90,17 @@
     let last = (end.ceil() as usize).min(len);
     let mut weighted = 0.0f64;
     let mut total = 0.0f64;
     for (offset, &value) in mono[first..last].iter().enumerate() {
         let cell_start = (first + offset) as f64;
         let cell_end = cell_start + 1.0;
         let overlap = cell_end.min(end) - cell_start.max(start);
         if overlap > 0.0 {
-            weighted += value as f64 * overlap;
+            weighted -= /* ~ changed by cargo-mutants ~ */ value as f64 * overlap;
             total += overlap;
         }
     }
 
     if total > 0.0 {
         (weighted / total) as f32
     } else {
         mono[first.min(len - 1)]
