--- src/main.rs
+++ replace install_engine_assets -> Result<EngineView, String> with Ok(Default::default())
@@ -1342,70 +1342,17 @@
 /// blocks for as long as that takes and reports no progress, so `on_progress`
 /// is simply unused on that branch.
 #[tauri::command]
 async fn install_engine_assets(
     app: tauri::AppHandle,
     engine: slugtale_lib::TranscriptionEngine,
     on_progress: tauri::ipc::Channel<slugtale_lib::DownloadProgress>,
 ) -> Result<EngineView, String> {
-    match engine {
-        slugtale_lib::TranscriptionEngine::Whisper => {
-            let manager = model_manager(&app)?;
-            let status = tauri::async_runtime::spawn_blocking(move || {
-                // Throttle IPC traffic: the initial update, then one per ~1 MB,
-                // plus the final update (slugtale-dtl).
-                let mut forward = slugtale_lib::throttled_progress(move |progress| {
-                    let _ = on_progress.send(progress);
-                });
-                manager
-                    .download_default(&slugtale_lib::HttpModelDownloader, &mut forward)
-                    .map_err(|error| error.to_string())
-            })
-            .await
-            .map_err(|error| error.to_string())??;
-            if status.present {
-                warm_effective_primary_engine(&app);
-            }
-        }
-        slugtale_lib::TranscriptionEngine::Parakeet => {
-            let provider = app
-                .state::<slugtale_lib::TranscriptionEngineCatalogue>()
-                .parakeet_provider()
-                .ok_or_else(|| "transcription engines are not ready yet".to_string())?;
-            let asset_dir = provider.asset_dir().to_path_buf();
-            tauri::async_runtime::spawn_blocking(move || {
-                // Throttle IPC traffic: the initial update, then one per ~1 MB,
-                // plus the final update (slugtale-dtl).
-                let mut forward = slugtale_lib::throttled_progress(move |progress| {
-                    let _ = on_progress.send(progress);
-                });
-                slugtale_lib::install_parakeet_assets(
-                    &asset_dir,
-                    &slugtale_lib::HttpModelDownloader,
-                    &mut forward,
-                )
-                .map_err(|error| error.to_string())
-            })
-            .await
-            .map_err(|error| error.to_string())??;
-            provider.refresh_availability();
-        }
-        slugtale_lib::TranscriptionEngine::AppleSpeech => {
-            let provider = app
-                .state::<slugtale_lib::TranscriptionEngineCatalogue>()
-                .apple_provider();
-            tauri::async_runtime::spawn_blocking(move || provider.request_asset_installation())
-                .await
-                .map_err(|error| error.to_string())??;
-        }
-    }
-
-    let settings = load_current_settings(&app);
-    build_engine_view(&app, &settings, engine)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Remove one engine's installed assets as an explicit user action
 /// (slugtale-vjs.4). Apple SpeechTranscriber's assets are macOS's, not
 /// Slugtale's, so there is nothing here to delete — the branch refuses rather
 /// than pretending to free space Slugtale never claimed.
 #[tauri::command]
 fn remove_engine_assets(
