--- src/main.rs
+++ replace begin_dictation -> Result<(), String> with Ok(())
@@ -149,64 +149,17 @@
     input: slugtale_lib::DictationInput,
     set_escape: &mut dyn FnMut(bool) -> Result<(), String>,
 ) -> Result<(), String> {
     // The Typing Challenge measures how fast the user types, so their hotkey
     // has to stay plain text for those thirty seconds. Swallowed here — before
     // any readiness snapshot is paid for or lifecycle state moves — so
     // releasing it later cannot resume anything. The guard stays in the host:
     // DictationControl only decides requests that reach it.
-    if typing_challenge_is_open(app) {
-        return Ok(());
-    }
-
-    let (activation, dictation_available) = {
-        let activation = build_activation_snapshot_for(app, input);
-        let available = activation.dictation_available();
-        if !available {
-            report_not_ready(app, &activation.report);
-        }
-        (Some(activation), available)
-    };
-
-    let event = {
-        let state = app.state::<HotkeyRegistrationState>();
-        let mut registration = state
-            .0
-            .lock()
-            .map_err(|_| "hotkey registration mutex poisoned".to_string())?;
-        registration.control.begin(dictation_available)
-    };
-    let Ok(event) = event else {
-        // NotReady has already had its user-facing report; AlreadyDictating
-        // report; AlreadyDictating means a later input changes nothing.
-        return Ok(());
-    };
-
-    // Recording has not started yet; arming Escape here keeps the window where
-    // the lifecycle says dictating but Escape is not global down to nothing.
-    if let Err(error) = set_escape(true) {
-        if let Ok(mut registration) = app.state::<HotkeyRegistrationState>().0.lock() {
-            registration.control.abandon_begin();
-        }
-        eprintln!("dictation did not start because global Escape could not be registered");
-        return Err(error);
-    }
-
-    if let Err(error) = dictation_host(app).handle_dictation_event_with(event, activation) {
-        // Roll the lifecycle back so the next activation can try again instead
-        // of finding a discarded dictation still marked active.
-        if let Ok(mut registration) = app.state::<HotkeyRegistrationState>().0.lock() {
-            registration.control.abandon_begin();
-            let _ = request_escape_registration(&registration, false);
-        }
-        return Err(error);
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn warm_effective_primary_engine(app: &tauri::AppHandle) {
     let settings = load_current_settings(app);
     let catalogue = app.state::<slugtale_lib::TranscriptionEngineCatalogue>();
     let Some(warm_up) = catalogue.prepare_primary_warm_up(&settings) else {
         return;
     };
