--- src/main.rs
+++ replace get_typing_challenge -> TypingChallengeState with Default::default()
@@ -1579,17 +1579,17 @@
         total: slugtale_lib::TYPING_CHALLENGE_COUNT,
         seconds: slugtale_lib::TYPING_CHALLENGE_SECONDS,
         measured_wpm: baseline.measured_wpm(),
     }
 }
 
 #[tauri::command]
 fn get_typing_challenge(app: tauri::AppHandle) -> TypingChallengeState {
-    typing_challenge_state(&load_current_settings(&app).typing_baseline)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Score one finished Typing Challenge and store it.
 ///
 /// The window sends the text as it finally stood, so backspacing is free — which
 /// is how people type, and the point is to measure that.
 #[tauri::command]
 fn submit_typing_challenge(
