--- src/main.rs
+++ replace typing_challenge_is_open -> bool with false
@@ -1686,17 +1686,17 @@
 
 /// Whether the Typing Challenge window is on screen right now.
 ///
 /// While it is, the dictation Hotkey does nothing at all (ADR-0025): the user is
 /// typing a passage, and their hotkey is very likely inside it. Doing nothing —
 /// rather than starting a dictation, or refusing with a notification — is what
 /// keeps the thirty seconds being a measurement of typing.
 fn typing_challenge_is_open(app: &tauri::AppHandle) -> bool {
-    app.state::<TypingChallengeOpen>().get()
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[tauri::command]
 fn get_local_model_status(app: tauri::AppHandle) -> Result<slugtale_lib::LocalModelStatus, String> {
     Ok(model_manager(&app)?.status())
 }
 
 #[tauri::command]
