--- src/main.rs
+++ replace CurrentPlatform::macos_platform -> slugtale_lib::MacosPlatform with Default::default()
@@ -1742,17 +1742,17 @@
 
 impl CurrentPlatform {
     fn new() -> Self {
         Self
     }
 
     #[cfg(target_os = "macos")]
     fn macos_platform(&self) -> slugtale_lib::MacosPlatform {
-        slugtale_lib::MacosPlatform::new()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(target_os = "windows")]
     fn windows_platform(&self) -> slugtale_lib::WindowsPlatform {
         slugtale_lib::WindowsPlatform::new()
     }
 
     #[cfg(target_os = "linux")]
