--- src/main.rs
+++ replace CurrentPlatform::windows_platform -> slugtale_lib::WindowsPlatform with Default::default()
@@ -1747,17 +1747,17 @@
 
     #[cfg(target_os = "macos")]
     fn macos_platform(&self) -> slugtale_lib::MacosPlatform {
         slugtale_lib::MacosPlatform::new()
     }
 
     #[cfg(target_os = "windows")]
     fn windows_platform(&self) -> slugtale_lib::WindowsPlatform {
-        slugtale_lib::WindowsPlatform::new()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(target_os = "linux")]
     fn linux_platform(&self) -> slugtale_lib::LinuxPlatform {
         slugtale_lib::LinuxPlatform::new()
     }
 }
 
