--- src/main.rs
+++ replace load_current_usage -> slugtale_lib::UsageFile with Default::default()
@@ -1784,17 +1784,17 @@
 
 /// The Usage File (CONTEXT.md): a sibling of the Settings File, so opting out
 /// deletes one obvious file and nothing else.
 fn usage_path(app: &tauri::AppHandle) -> Option<PathBuf> {
     app_files(app).usage_path()
 }
 
 fn load_current_usage(app: &tauri::AppHandle) -> slugtale_lib::UsageFile {
-    app_files(app).usage()
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Which week the Usage pane means by "this week", asked of the OS rather than
 /// assumed (ADR-0021: locale is platform behaviour).
 fn locale_week_start(_app: &tauri::AppHandle) -> slugtale_lib::WeekStart {
     #[cfg(any(target_os = "macos", target_os = "windows", target_os = "linux"))]
     {
         slugtale_lib::locale_week_start()
