--- src/main.rs
+++ replace usage_writer -> std::sync::Arc<slugtale_lib::UsageSink> with Arc::new(Default::default())
@@ -1806,43 +1806,17 @@
     }
 }
 
 /// Start the Dictation Runtime's Usage writer body (ADR-0025): the opt-in is
 /// checked here, at the last possible moment, so a segment that was in flight
 /// when the user turned storing off does not land in a file they just asked to
 /// be deleted. Every failure below is a skip, not an error.
 fn usage_writer(app: tauri::AppHandle) -> std::sync::Arc<slugtale_lib::UsageSink> {
-    std::sync::Arc::new(move |date, segment| {
-        if !load_current_settings(&app).store_usage {
-            return;
-        }
-        let Some(path) = usage_path(&app) else {
-            return;
-        };
-        if let Some(parent) = path.parent() {
-            if std::fs::create_dir_all(parent).is_err() {
-                return;
-            }
-        }
-
-        let mut usage = slugtale_lib::load_usage(&path);
-        slugtale_lib::record_counted_segment(&mut usage, date, segment);
-        if let Err(error) = slugtale_lib::save_usage(&path, &usage) {
-            eprintln!("could not write the usage file: {error}");
-            return;
-        }
-
-        // The Usage pane is the only surface that shows any of this, so
-        // it is the only thing told. Nothing reaches the Pill, the tray,
-        // or a notification (ADR-0025).
-        if let Some(window) = app.get_webview_window("settings") {
-            let _ = window.emit("usage-changed", ());
-        }
-    })
+    Arc::new(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn load_current_settings(app: &tauri::AppHandle) -> slugtale_lib::Settings {
     app_files(app).settings()
 }
 
 fn current_diagnostic_log(
     app: &tauri::AppHandle,
