--- src/main.rs
+++ replace <impl DictationSurface for TauriSurface>::record_diagnostic_event with ()
@@ -226,17 +226,17 @@
 }
 
 impl DictationSurface for TauriSurface {
     fn settings(&self) -> slugtale_lib::Settings {
         load_current_settings(&self.app)
     }
 
     fn record_diagnostic_event(&self, event: slugtale_lib::DiagnosticEvent) {
-        record_diagnostic_event(&self.app, event);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn show_dictation_bar(&self, phase: DictationPhase, settings: &slugtale_lib::Settings) {
         show_dictation_bar(&self.app, phase, settings);
     }
 
     fn hide_dictation_bar(&self) {
         hide_dictation_bar(&self.app);
