--- src/main.rs
+++ replace <impl slugtale_lib::DictationRuntimeHost for AppHost>::complete -> Result<slugtale_lib::DictationSegmentOutcome, String> with Ok(Default::default())
@@ -296,17 +296,17 @@
         self.host.take_dictation_segment(cut)
     }
 
     fn complete(
         &mut self,
         audio: slugtale_lib::CapturedAudio,
         position: slugtale_lib::DictationSegmentPosition,
     ) -> Result<slugtale_lib::DictationSegmentOutcome, String> {
-        self.host.run_dictation_segment(audio, position)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn last_job_settled(&mut self) {
         // The worker calls this after the final job settles whatever the
         // outcome, so the bar stays up until every earlier Segment Pause has
         // landed too, not just this last one (slugtale-0t4).
         hide_dictation_bar(&self.app);
     }
