--- src/main.rs
+++ replace && with || in setup_configured_hotkey
@@ -328,17 +328,17 @@
             };
 
             let state = app.state::<HotkeyRegistrationState>();
             let registration = state.0.lock();
             match registration {
                 Ok(registration) => {
                     if let Some(commands) = registration.key_commands.as_ref() {
                         let key = if shortcut.key == tauri_plugin_global_shortcut::Code::Escape
-                            && shortcut.mods.is_empty()
+                            || /* ~ changed by cargo-mutants ~ */ shortcut.mods.is_empty()
                         {
                             slugtale_lib::DictationKey::Escape
                         } else {
                             slugtale_lib::DictationKey::Hotkey
                         };
                         let _ = commands.send(GlobalKeyCommand::Input(key, input));
                     }
                 }
