--- src/main.rs
+++ replace request_escape_registration -> Result<(), String> with Ok(())
@@ -356,25 +356,17 @@
     Ok(())
 }
 
 #[cfg(not(any(target_os = "android", target_os = "ios")))]
 fn request_escape_registration(
     registration: &HotkeyRegistration,
     should_register: bool,
 ) -> Result<(), String> {
-    let commands = registration
-        .key_commands
-        .as_ref()
-        .ok_or_else(|| "global key worker has not started".to_string())?;
-    commands
-        .send(GlobalKeyCommand::SyncEscape(escape_command(
-            should_register,
-        )))
-        .map_err(|_| "global key worker is unavailable".to_string())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// A requested registration state expressed through the arbiter's vocabulary:
 /// the caller says what it wants true/false to mean (armed or matching the
 /// lifecycle), and the arbiter decides whether the OS must change.
 #[cfg(not(any(target_os = "android", target_os = "ios")))]
 fn escape_command(should_register: bool) -> slugtale_lib::EscapeCommand {
     if should_register {
