--- src/main.rs
+++ replace sync_escape_registration -> Result<(), String> with Ok(())
@@ -514,30 +514,17 @@
 }
 
 #[cfg(not(any(target_os = "android", target_os = "ios")))]
 fn sync_escape_registration(
     app: &tauri::AppHandle,
     arbiter: &mut slugtale_lib::EscapeArbiter,
     command: slugtale_lib::EscapeCommand,
 ) -> Result<(), String> {
-    let Some(should_register) = arbiter.resolve(command) else {
-        return Ok(());
-    };
-
-    if should_register {
-        app.global_shortcut()
-            .register(DICTATION_ESCAPE_KEY)
-            .map_err(|error| error.to_string())?;
-    } else {
-        app.global_shortcut()
-            .unregister(DICTATION_ESCAPE_KEY)
-            .map_err(|error| error.to_string())?;
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(any(target_os = "android", target_os = "ios")))]
 fn set_hotkey_registration_state(
     app: &tauri::AppHandle,
     settings: &slugtale_lib::Settings,
 ) -> Result<(), String> {
     let state = app.state::<HotkeyRegistrationState>();
