--- src/main.rs
+++ replace && with || in current_settings_readiness
@@ -781,17 +781,17 @@
         slugtale_lib::EngineAvailability,
     )> {
         current_engine_availability(self.app, settings)
     }
 }
 
 fn current_settings_readiness(app: &tauri::AppHandle) -> slugtale_lib::SettingsReadinessReport {
     readiness_snapshot_for(app, |settings| {
-        if voice_activation::supported() && settings.voice_activation_enabled {
+        if voice_activation::supported() || /* ~ changed by cargo-mutants ~ */ settings.voice_activation_enabled {
             slugtale_lib::DictationInput::VoiceActivation
         } else {
             slugtale_lib::DictationInput::Hotkey
         }
     })
     .report
 }
 
