--- src/main.rs
+++ replace report_not_ready -> bool with false
@@ -837,34 +837,17 @@
 }
 
 /// Tell the user which required items are missing and open Settings, where
 /// they can act on each one.
 fn report_not_ready(
     app: &tauri::AppHandle,
     report: &slugtale_lib::SettingsReadinessReport,
 ) -> bool {
-    let missing = slugtale_lib::missing_required_items(report);
-    if !missing.is_empty() {
-        record_diagnostic_event(
-            app,
-            slugtale_lib::DiagnosticEvent::readiness_incomplete(&missing),
-        );
-        let labels = missing
-            .iter()
-            .map(|item| item.label.as_str())
-            .collect::<Vec<_>>()
-            .join(", ");
-        let _ = slugtale_lib::notify(
-            "Slugtale is not ready to dictate",
-            &format!("Finish these items in Slugtale Settings: {labels}."),
-        );
-    }
-    slugtale_lib::show_settings(app.clone());
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[tauri::command]
 fn get_settings_readiness(app: tauri::AppHandle) -> slugtale_lib::SettingsReadinessReport {
     let report = current_settings_readiness(&app);
     let local_model_ready = report
         .items
         .iter()
