--- src/platform_execution.rs
+++ replace <impl TextInsertion for SettledTextInsertion>::insert -> Result<crate::TextInsertionOutcome, crate::TextInsertionError> with Ok(Default::default())
@@ -65,21 +65,17 @@
     }
 }
 
 impl TextInsertion for SettledTextInsertion {
     fn insert(
         &self,
         transcription: &crate::FinalTranscription,
     ) -> Result<crate::TextInsertionOutcome, crate::TextInsertionError> {
-        let remaining = self.settle_remaining_at(std::time::Instant::now());
-        if !remaining.is_zero() {
-            std::thread::sleep(remaining);
-        }
-        self.inner.insert(transcription)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Prepare the current Platform Adapter for Text Insertion into the segment's
 /// target.
 ///
 /// Focus restoration deliberately repeats for every Dictation Segment. This is
 /// the ADR-0015 rule that makes a Pause Flush behave like ordinary Immediate
