--- src/recording_feedback.rs
+++ replace play_sound -> std::io::Result<()> with Ok(())
@@ -120,17 +120,17 @@
     // above behind the same boundary.
     crate::windows::play_dictation_sound(sound)
 }
 
 #[cfg(target_os = "linux")]
 fn play_sound(sound: DictationSound) -> std::io::Result<()> {
     // The XDG sound-theme call lives in the platform adapter (ADR-0021) so this
     // module stays free of OS specifics, matching the Windows arm above.
-    crate::linux::play_dictation_sound(sound)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(any(target_os = "macos", target_os = "windows", target_os = "linux")))]
 fn play_sound(_sound: DictationSound) -> std::io::Result<()> {
     // Other platforms get audible feedback once their Platform Adapter lands
     // (ADR-0021); the recording lifecycle stays platform-agnostic until then.
     Ok(())
 }
