--- src/recording_feedback.rs
+++ delete ! in RecordingFeedback::on_event
@@ -52,17 +52,17 @@
         self.bar_visible
     }
 
     pub fn on_event(&mut self, event: DictationEvent) -> RecordingFeedbackEffect {
         // Stop and Cancel only matter while a dictation is on screen. Ignoring
         // them once the bar is hidden keeps a stray terminal event (e.g. a
         // hold-mode key release arriving after Escape) from replaying a sound or
         // re-ending the session.
-        if matches!(event, DictationEvent::Stop | DictationEvent::Cancel) && !self.bar_visible {
+        if matches!(event, DictationEvent::Stop | DictationEvent::Cancel) &&  /* ~ changed by cargo-mutants ~ */self.bar_visible {
             return RecordingFeedbackEffect {
                 sound: None,
                 bar_visible: false,
                 outcome: None,
             };
         }
 
         match event {
