--- src/settings.rs
+++ replace apply_and_persist -> Result<Settings, String> with Ok(Default::default())
@@ -181,24 +181,17 @@
 /// launch at login, the Voice Activation worker) goes through here; hand
 /// copies of this dance had already drifted.
 pub fn apply_and_persist(
     current: &Settings,
     apply: impl FnOnce(&mut Settings),
     side_effect: impl Fn(&Settings) -> Result<(), String>,
     persist: impl FnOnce(&Settings) -> Result<(), String>,
 ) -> Result<Settings, String> {
-    let mut settings = current.clone();
-    apply(&mut settings);
-    side_effect(&settings)?;
-    if let Err(error) = persist(&settings) {
-        let _ = side_effect(current);
-        return Err(error);
-    }
-    Ok(settings)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Update which Transcription Engine leads and whether a second local engine
 /// may be asked for another opinion (slugtale-vjs.3, slugtale-vjs.4).
 ///
 /// This does not check that the chosen engine can actually run. Availability
 /// depends on installed assets and on the machine, both of which can change
 /// after the choice is made, so it is resolved when a dictation starts rather
