--- src/text_insertion.rs
+++ replace <impl std::fmt::Display for InsertionRescueError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -96,17 +96,17 @@
         Self {
             message: message.into(),
         }
     }
 }
 
 impl std::fmt::Display for InsertionRescueError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        write!(f, "insertion rescue failed: {}", self.message)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for InsertionRescueError {}
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub enum InsertionRescueOutcome {
     CopiedToClipboardAndNotified,
