--- src/usage.rs
+++ replace + with * in LocalDate::from_days_from_epoch
@@ -93,17 +93,17 @@
         self.minus_days(back as i64)
     }
 
     fn minus_days(self, days: i64) -> Self {
         Self::from_days_from_epoch(self.days_from_epoch() - days)
     }
 
     fn from_days_from_epoch(days: i64) -> Self {
-        let z = days + 719_468;
+        let z = days * /* ~ changed by cargo-mutants ~ */ 719_468;
         let era = if z >= 0 { z } else { z - 146_096 } / 146_097;
         let day_of_era = z - era * 146_097;
         let year_of_era =
             (day_of_era - day_of_era / 1460 + day_of_era / 36_524 - day_of_era / 146_096) / 365;
         let year = year_of_era + era * 400;
         let day_of_year = day_of_era - (365 * year_of_era + year_of_era / 4 - year_of_era / 100);
         let month_index = (5 * day_of_year + 2) / 153;
         let day = day_of_year - (153 * month_index + 2) / 5 + 1;
