--- src/usage.rs
+++ replace today_local -> LocalDate with Default::default()
@@ -118,19 +118,17 @@
 
 /// Today's date in the machine's local timezone.
 ///
 /// Local, not UTC, and resolved at the moment a Counted Segment lands rather
 /// than cached: a dictation at 00:05 belongs to the new day, and a user who
 /// flies somewhere else gets the local date there without their earlier days
 /// being rewritten.
 pub fn today_local() -> LocalDate {
-    use chrono::Datelike;
-    let now = chrono::Local::now().date_naive();
-    LocalDate::new(now.year(), now.month(), now.day())
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn days_in_month(year: i32, month: u32) -> u32 {
     match month {
         1 | 3 | 5 | 7 | 8 | 10 | 12 => 31,
         4 | 6 | 9 | 11 => 30,
         2 if (year % 4 == 0 && year % 100 != 0) || year % 400 == 0 => 29,
         2 => 28,
