--- src/usage.rs
+++ replace days_in_month -> u32 with 1
@@ -124,23 +124,17 @@
 /// being rewritten.
 pub fn today_local() -> LocalDate {
     use chrono::Datelike;
     let now = chrono::Local::now().date_naive();
     LocalDate::new(now.year(), now.month(), now.day())
 }
 
 fn days_in_month(year: i32, month: u32) -> u32 {
-    match month {
-        1 | 3 | 5 | 7 | 8 | 10 | 12 => 31,
-        4 | 6 | 9 | 11 => 30,
-        2 if (year % 4 == 0 && year % 100 != 0) || year % 400 == 0 => 29,
-        2 => 28,
-        _ => 0,
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub enum Weekday {
     Sunday,
     Monday,
     Tuesday,
     Wednesday,
