--- src/usage.rs
+++ delete match arm 1 | 3 | 5 | 7 | 8 | 10 | 12 in days_in_month
@@ -125,17 +125,17 @@
 pub fn today_local() -> LocalDate {
     use chrono::Datelike;
     let now = chrono::Local::now().date_naive();
     LocalDate::new(now.year(), now.month(), now.day())
 }
 
 fn days_in_month(year: i32, month: u32) -> u32 {
     match month {
-        1 | 3 | 5 | 7 | 8 | 10 | 12 => 31,
+         /* ~ changed by cargo-mutants ~ */
         4 | 6 | 9 | 11 => 30,
         2 if (year % 4 == 0 && year % 100 != 0) || year % 400 == 0 => 29,
         2 => 28,
         _ => 0,
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
