--- src/usage.rs
+++ delete match arm 4 | 6 | 9 | 11 in days_in_month
@@ -126,17 +126,17 @@
     use chrono::Datelike;
     let now = chrono::Local::now().date_naive();
     LocalDate::new(now.year(), now.month(), now.day())
 }
 
 fn days_in_month(year: i32, month: u32) -> u32 {
     match month {
         1 | 3 | 5 | 7 | 8 | 10 | 12 => 31,
-        4 | 6 | 9 | 11 => 30,
+         /* ~ changed by cargo-mutants ~ */
         2 if (year % 4 == 0 && year % 100 != 0) || year % 400 == 0 => 29,
         2 => 28,
         _ => 0,
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub enum Weekday {
