--- src/usage.rs
+++ replace == with != in record_counted_segment
@@ -264,17 +264,17 @@
 /// Add one Counted Segment to the day it landed on.
 ///
 /// A Counted Segment belongs to the local date of its insert or rescue, so a
 /// dictation started before midnight and finished after it puts its later
 /// segments on the later day. That is the honest answer and it means old days
 /// are never rewritten.
 pub fn record_counted_segment(usage: &mut UsageFile, date: LocalDate, segment: CountedSegment) {
     let iso = date.to_iso();
-    let record = match usage.days.iter_mut().find(|record| record.date == iso) {
+    let record = match usage.days.iter_mut().find(|record| record.date != /* ~ changed by cargo-mutants ~ */ iso) {
         Some(record) => record,
         None => {
             usage.days.push(DailyUsageRecord::empty(date));
             usage.days.sort_by(|a, b| a.date.cmp(&b.date));
             usage
                 .days
                 .iter_mut()
                 .find(|record| record.date == iso)
