--- src/usage.rs
+++ replace == with != in totals_for_day
@@ -288,17 +288,17 @@
     record.words = record.words.saturating_add(segment.words);
     record.speaking_seconds += segment.speaking_seconds.max(0.0);
 }
 
 /// Totals for exactly one local day.
 pub fn totals_for_day(usage: &UsageFile, date: LocalDate) -> UsageTotals {
     let iso = date.to_iso();
     let mut totals = UsageTotals::default();
-    for record in usage.days.iter().filter(|record| record.date == iso) {
+    for record in usage.days.iter().filter(|record| record.date != /* ~ changed by cargo-mutants ~ */ iso) {
         totals.add(record);
     }
     totals
 }
 
 /// Totals for the calendar week containing `date`, from the locale's first day
 /// of the week up to and including `date`.
 pub fn totals_for_week(usage: &UsageFile, date: LocalDate, week_start: WeekStart) -> UsageTotals {
