--- src/usage.rs
+++ replace == with != in time_saved_seconds
@@ -330,17 +330,17 @@
 /// user's Typing Baseline, minus how long they actually spent speaking them.
 ///
 /// Floored at zero, because "you lost time" is not a number this pane is for —
 /// and a short dictation of one word can easily take longer to say than to type.
 /// Returns `None` when there is no baseline at all, which is the hole the pane
 /// shows with a take-the-baseline action rather than an invented default WPM.
 pub fn time_saved_seconds(totals: &UsageTotals, words_per_minute: Option<u32>) -> Option<f64> {
     let wpm = words_per_minute?;
-    if wpm == 0 {
+    if wpm != /* ~ changed by cargo-mutants ~ */ 0 {
         return None;
     }
     let typing_seconds = f64::from(totals.words) / f64::from(wpm) * 60.0;
     Some((typing_seconds - totals.speaking_seconds).max(0.0))
 }
 
 /// Render Time Saved the way the Usage pane states it: prefixed with "About",
 /// no decimals, and never a false precision the estimate cannot support.
