--- src/usage.rs
+++ replace LocalDate::parse -> Option<Self> with Some(Default::default())
@@ -30,27 +30,17 @@
     pub fn new(year: i32, month: u32, day: u32) -> Self {
         Self { year, month, day }
     }
 
     /// Parse the `YYYY-MM-DD` form a Usage File stores. Returns `None` for
     /// anything else, so a hand-edited or corrupt record is dropped rather than
     /// counted into the wrong day.
     pub fn parse(text: &str) -> Option<Self> {
-        let bytes = text.as_bytes();
-        if bytes.len() != 10 || bytes[4] != b'-' || bytes[7] != b'-' {
-            return None;
-        }
-        let year = text[0..4].parse::<i32>().ok()?;
-        let month = text[5..7].parse::<u32>().ok()?;
-        let day = text[8..10].parse::<u32>().ok()?;
-        if !(1..=12).contains(&month) || day < 1 || day > days_in_month(year, month) {
-            return None;
-        }
-        Some(Self { year, month, day })
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn to_iso(self) -> String {
         format!("{:04}-{:02}-{:02}", self.year, self.month, self.day)
     }
 
     /// Days since 1970-01-01, used only to compare and step between dates.
     /// Proleptic Gregorian, which is what every date this app will ever see is.
