--- src/usage.rs
+++ replace LocalDate::to_iso -> String with "xyzzy".into()
@@ -44,17 +44,17 @@
         let day = text[8..10].parse::<u32>().ok()?;
         if !(1..=12).contains(&month) || day < 1 || day > days_in_month(year, month) {
             return None;
         }
         Some(Self { year, month, day })
     }
 
     pub fn to_iso(self) -> String {
-        format!("{:04}-{:02}-{:02}", self.year, self.month, self.day)
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Days since 1970-01-01, used only to compare and step between dates.
     /// Proleptic Gregorian, which is what every date this app will ever see is.
     pub fn days_from_epoch(self) -> i64 {
         // Shift the year so leap days land at the end of the cycle, which makes
         // the century rules a plain division instead of a special case.
         let year = if self.month <= 2 {
