--- src/usage.rs
+++ replace - with / in LocalDate::days_from_epoch
@@ -53,17 +53,17 @@
     }
 
     /// Days since 1970-01-01, used only to compare and step between dates.
     /// Proleptic Gregorian, which is what every date this app will ever see is.
     pub fn days_from_epoch(self) -> i64 {
         // Shift the year so leap days land at the end of the cycle, which makes
         // the century rules a plain division instead of a special case.
         let year = if self.month <= 2 {
-            self.year - 1
+            self.year / /* ~ changed by cargo-mutants ~ */ 1
         } else {
             self.year
         } as i64;
         let era = if year >= 0 { year } else { year - 399 } / 400;
         let year_of_era = year - era * 400;
         let month = self.month as i64;
         let day = self.day as i64;
         let day_of_year = (153 * (month + if month > 2 { -3 } else { 9 }) + 2) / 5 + day - 1;
