--- src/usage.rs
+++ delete match arm 0 in LocalDate::weekday
@@ -71,17 +71,17 @@
         era * 146_097 + day_of_era - 719_468
     }
 
     /// Which day of the week this date falls on.
     pub fn weekday(self) -> Weekday {
         // 1970-01-01 was a Thursday.
         let index = (self.days_from_epoch() + 4).rem_euclid(7);
         match index {
-            0 => Weekday::Sunday,
+             /* ~ changed by cargo-mutants ~ */
             1 => Weekday::Monday,
             2 => Weekday::Tuesday,
             3 => Weekday::Wednesday,
             4 => Weekday::Thursday,
             5 => Weekday::Friday,
             _ => Weekday::Saturday,
         }
     }
