--- src/usage.rs
+++ delete match arm 1 in LocalDate::weekday
@@ -72,17 +72,17 @@
     }
 
     /// Which day of the week this date falls on.
     pub fn weekday(self) -> Weekday {
         // 1970-01-01 was a Thursday.
         let index = (self.days_from_epoch() + 4).rem_euclid(7);
         match index {
             0 => Weekday::Sunday,
-            1 => Weekday::Monday,
+             /* ~ changed by cargo-mutants ~ */
             2 => Weekday::Tuesday,
             3 => Weekday::Wednesday,
             4 => Weekday::Thursday,
             5 => Weekday::Friday,
             _ => Weekday::Saturday,
         }
     }
 
