--- src/usage.rs
+++ delete match arm 2 in LocalDate::weekday
@@ -73,17 +73,17 @@
 
     /// Which day of the week this date falls on.
     pub fn weekday(self) -> Weekday {
         // 1970-01-01 was a Thursday.
         let index = (self.days_from_epoch() + 4).rem_euclid(7);
         match index {
             0 => Weekday::Sunday,
             1 => Weekday::Monday,
-            2 => Weekday::Tuesday,
+             /* ~ changed by cargo-mutants ~ */
             3 => Weekday::Wednesday,
             4 => Weekday::Thursday,
             5 => Weekday::Friday,
             _ => Weekday::Saturday,
         }
     }
 
     /// The first date of the calendar week containing this date, given where the
