--- src/usage.rs
+++ delete match arm 4 in LocalDate::weekday
@@ -75,17 +75,17 @@
     pub fn weekday(self) -> Weekday {
         // 1970-01-01 was a Thursday.
         let index = (self.days_from_epoch() + 4).rem_euclid(7);
         match index {
             0 => Weekday::Sunday,
             1 => Weekday::Monday,
             2 => Weekday::Tuesday,
             3 => Weekday::Wednesday,
-            4 => Weekday::Thursday,
+             /* ~ changed by cargo-mutants ~ */
             5 => Weekday::Friday,
             _ => Weekday::Saturday,
         }
     }
 
     /// The first date of the calendar week containing this date, given where the
     /// user's locale starts its weeks.
     pub fn week_start(self, week_start: WeekStart) -> Self {
