--- src/usage.rs
+++ delete match arm 5 in LocalDate::weekday
@@ -76,17 +76,17 @@
         // 1970-01-01 was a Thursday.
         let index = (self.days_from_epoch() + 4).rem_euclid(7);
         match index {
             0 => Weekday::Sunday,
             1 => Weekday::Monday,
             2 => Weekday::Tuesday,
             3 => Weekday::Wednesday,
             4 => Weekday::Thursday,
-            5 => Weekday::Friday,
+             /* ~ changed by cargo-mutants ~ */
             _ => Weekday::Saturday,
         }
     }
 
     /// The first date of the calendar week containing this date, given where the
     /// user's locale starts its weeks.
     pub fn week_start(self, week_start: WeekStart) -> Self {
         let back = (self.weekday().index() + 7 - week_start.weekday().index()) % 7;
